## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 3 to change, 42 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_storage_account.xcutting[&#34;00&#34;]
  * azurerm_storage_account.xcutting[&#34;01&#34;]
  * azurerm_storage_account.xcutting[&#34;02&#34;]
* Delete
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-td&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-td&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # data.azurerm_storage_account_sas.xcutting["01"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # data.azurerm_storage_account_sas.xcutting["02"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-aplfpa"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/6be63684-e1ec-470b-8a16-ab1337c0252c" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "6be63684-e1ec-470b-8a16-ab1337c0252c" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-aplfta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/4fbddc51-9662-4343-bdd0-570fc950e0ed" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "4fbddc51-9662-4343-bdd0-570fc950e0ed" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-apluta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/1789119f-88ac-4ce6-8716-7b4e684d182e" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "1789119f-88ac-4ce6-8716-7b4e684d182e" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-bails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/72e6893c-9d79-465b-b173-0e0eea285b3d" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "72e6893c-9d79-465b-b173-0e0eea285b3d" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-joh"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/7cdc9deb-7bc6-41d4-ae37-eb284db52480" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "7cdc9deb-7bc6-41d4-ae37-eb284db52480" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-sbails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/a49b42dd-164a-433a-b2e7-72acaffe4e7b" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "a49b42dd-164a-433a-b2e7-72acaffe4e7b" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-td"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/318b507a-008b-4225-88b3-166c226afe88" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "318b507a-008b-4225-88b3-166c226afe88" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-aplfpa"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/objectId/d8689332-e3e9-41c6-a279-21fdd669f357" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - object_id               = "d8689332-e3e9-41c6-a279-21fdd669f357" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-aplfta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/objectId/d73f24a5-5e34-4152-8c3c-8c8221876dc2" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - object_id               = "d73f24a5-5e34-4152-8c3c

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 - "20.49.174.159",
          - "20.49.174.164",
          - "20.49.174.187",
          - "20.49.175.107",
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.49.241.62",
          - "20.49.241.70",
          - "20.49.241.88",
          - "20.49.241.216",
          - "20.49.241.223",
          - "20.49.241.234",
          - "20.49.243.58",
          - "20.49.243.61",
          - "20.49.243.176",
          - "20.49.243.182",
          - "20.49.243.196",
          - "20.49.243.199",
          - "20.90.134.28",
        ] -> null
      - possible_outbound_ip_addresses                 = "20.49.241.240,20.49.242.29,20.49.242.61,20.49.242.68,20.49.242.92,20.49.242.171,20.49.174.115,20.49.174.138,20.49.174.159,20.49.174.164,20.49.174.187,20.49.175.107,20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.49.241.62,20.49.241.70,20.49.241.88,20.49.241.216,20.49.241.223,20.49.241.234,20.49.243.58,20.49.243.61,20.49.243.176,20.49.243.182,20.49.243.196,20.49.243.199,20.90.134.28" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest02-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-sbails-sbox02-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest02xcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "9b1897f8-7c28-406f-a407-b756ce5da3e8" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - remote_debugging_version                      = "VS2022" -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "VSTSRM" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (6 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.11" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # azurerm_linux_function_app.example["02-af-td"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "02"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true"
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = "0"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-td-sbox02-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-td-sbox02-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-td-sbox02-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.90.134.28",
        ] -> null
      - outbound_ip_addresses                          = "20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.90.134.28" -> null
      - possible_outbound_ip_address_list              = [
          - "20.49.241.240",
          - "20.49.242.29",
          - "20.49.242.61",
          - "20.49.242.68",
          - "20.49.242.92",
          - "20.49.242.171",
          - "20.49.174.115",
          - "20.49.174.138",
          - "20.49.174.159",
          - "20.49.174.164",
          - "20.49.174.187",
          - "20.49.175.107",
          - "20.49.175.166",
          - "20.49.240.48",
          - "20.49.240.76",
          - "20.49.240.198",
          - "20.49.240.241",
          - "20.49.241.32",
          - "20.49.241.62",
          - "20.49.241.70",
          - "20.49.241.88",
          - "20.49.241.216",
          - "20.49.241.223",
          - "20.49.241.234",
          - "20.49.243.58",
          - "20.49.243.61",
          - "20.49.243.176",
          - "20.49.243.182",
          - "20.49.243.196",
          - "20.49.243.199",
          - "20.90.134.28",
        ] -> null
      - possible_outbound_ip_addresses                 = "20.49.241.240,20.49.242.29,20.49.242.61,20.49.242.68,20.49.242.92,20.49.242.171,20.49.174.115,20.49.174.138,20.49.174.159,20.49.174.164,20.49.174.187,20.49.175.107,20.49.175.166,20.49.240.48,20.49.240.76,20.49.240.198,20.49.240.241,20.49.241.32,20.49.241.62,20.49.241.70,20.49.241.88,20.49.241.216,20.49.241.223,20.49.241.234,20.49.243.58,20.49.243.61,20.49.243.176,20.49.243.182,20.49.243.196,20.49.243.199,20.90.134.28" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest02-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-td-sbox02-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest02xcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "c31dcf51-01e5-457f-8413-c2270c0aa159" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - remote_debugging_version                      = "VS2022" -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "VSTSRM" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (6 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.11" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # azurerm_storage_account.xcutting["00"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingsbox"
        name                               = "ingest00xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.xcutting["01"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01xcuttingsbox"
        name                               = "ingest01xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.xcutting["02"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02xcuttingsbox"
        name                               = "ingest02xcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 3 to change, 42 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":175,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->